{"config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "conv2d_1", "activity_regularizer": null, "padding": "valid", "batch_input_shape": [null, 32, 32, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "pool_size": [1, 1], "padding": "valid", "name": "max_pooling2d_1", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "conv2d_3", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "conv2d_4", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_2", "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "conv2d_5", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "filters": 256}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dense_1", "activity_regularizer": null, "units": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dense_2", "activity_regularizer": null, "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_3", "activity_regularizer": null, "units": 10, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}